In [1]:
%load_ext sql

In [2]:
%%sql
mysql://stu2000011483:stu2000011483@162.105.146.37:53306

In [3]:
%%sql 
use stu2000011483;

 * mysql://stu2000011483:***@162.105.146.37:53306
0 rows affected.

[]

# 初级约束设计

In [4]:
%%sql

#创建Dept 
set @@foreign_key_checks=0;
drop table if exists Dept;
CREATE TABLE Dept (
    dno bigint(4) unsigned zerofill PRIMARY KEY NOT NULL AUTO_INCREMENT,
    dname ENUM('数学学院', '计算机学院', '智能学院', '电子学院', '元培学院'),
    budget DECIMAL,
    manager bigint(4) unsigned zerofill
);

 * mysql://stu2000011483:***@162.105.146.37:53306
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [5]:
%%sql

#创建Emp
set @@foreign_key_checks=0;
drop table if exists Emp;
CREATE TABLE Emp (
    eno bigint(4) unsigned zerofill PRIMARY KEY NOT NULL AUTO_INCREMENT,
    ename VARCHAR(255),
    birthday DATE,
    level INT DEFAULT 3 CHECK (level >= 1 AND level <= 5),
    position ENUM('教师', '教务', '会计', '秘书'),
    salary DECIMAL CHECK (salary >= 2000 AND salary <= 200000),
    dno bigint(4) unsigned zerofill
);

 * mysql://stu2000011483:***@162.105.146.37:53306
0 rows affected.
0 rows affected.
0 rows affected.

[]

##### 插入数据
1. 正常插入

In [6]:
%%sql

#插入数据

set @@foreign_key_checks=0;
INSERT INTO Dept (dname, budget, manager) VALUES 
('数学学院', 100000, 1),
('计算机学院', 200000, 2),
('智能学院', 150000, 3),
('电子学院', 180000, 4),
('元培学院', 120000, 5);

INSERT INTO Emp (ename, birthday, level, position, salary, dno) VALUES 
('张三', '1980-01-01', 4, '教师', 5000, 1),
('王五', '1990-03-03', 5, '会计', 6000, 3),
('赵六', '1995-04-04', 2, '秘书', 3000, 4),
('孙七', '2000-05-05', 1, '教师', 2000, 5);

INSERT INTO Emp (ename, birthday, position, salary, dno) VALUES
('李四', '1985-02-02','教务', 4000, 2);

 * mysql://stu2000011483:***@162.105.146.37:53306
0 rows affected.
5 rows affected.
4 rows affected.
1 rows affected.

[]

In [7]:
%%sql

SELECT LPAD(eno, 4, '0') AS eno, ename, birthday, level, position, salary, LPAD(dno, 4, '0') AS dno FROM Emp;

 * mysql://stu2000011483:***@162.105.146.37:53306
5 rows affected.

[('0001', '张三', datetime.date(1980, 1, 1), 4, '教师', Decimal('5000'), '0001'),
 ('0002', '王五', datetime.date(1990, 3, 3), 5, '会计', Decimal('6000'), '0003'),
 ('0003', '赵六', datetime.date(1995, 4, 4), 2, '秘书', Decimal('3000'), '0004'),
 ('0004', '孙七', datetime.date(2000, 5, 5), 1, '教师', Decimal('2000'), '0005'),
 ('0005', '李四', datetime.date(1985, 2, 2), 3, '教务', Decimal('4000'), '0002')]

2. 违规插入

In [8]:
%%sql
INSERT INTO Dept (dname, budget, manager) VALUES 
('物理学院', 100000, 1);

 * mysql://stu2000011483:***@162.105.146.37:53306
(MySQLdb.DataError) (1265, "Data truncated for column 'dname' at row 1")
[SQL: INSERT INTO Dept (dname, budget, manager) VALUES
('物理学院', 100000, 1);]
(Background on this error at: https://sqlalche.me/e/20/9h9h)

In [9]:
%%sql
INSERT INTO Emp (ename, birthday, level, position, salary, dno) VALUES 
('张三', '1980-01-01', 4, '教师', 12, 1);

 * mysql://stu2000011483:***@162.105.146.37:53306
(MySQLdb.OperationalError) (3819, "Check constraint 'Emp_chk_2' is violated.")
[SQL: INSERT INTO Emp (ename, birthday, level, position, salary, dno) VALUES
('张三', '1980-01-01', 4, '教师', 12, 1);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

##### 测试三种外码方式
1. CASCADE
- 父表中的某行数据被删除或更新时，所有与之关联的子表中的行也将自动被删除或更新。换句话说，级联操作会传播到子表，保持数据的一致性
- 删除dept上dno=1的结果是Emp上dno=1的也会被删除

In [10]:
%%sql

set @@foreign_key_checks=1;
ALTER TABLE Emp
ADD CONSTRAINT cascade_emp
FOREIGN KEY (dno) REFERENCES Dept(dno) ON DELETE CASCADE ON UPDATE CASCADE;

ALTER TABLE Dept
ADD CONSTRAINT cascade_dept
FOREIGN KEY (manager) REFERENCES Emp(eno) ON DELETE CASCADE ON UPDATE CASCADE;

 * mysql://stu2000011483:***@162.105.146.37:53306
0 rows affected.
5 rows affected.
5 rows affected.

[]

In [11]:
%%sql
DELETE FROM Dept WHERE dno = 1;
SELECT * FROM Emp WHERE dno = 1;

 * mysql://stu2000011483:***@162.105.146.37:53306
1 rows affected.
0 rows affected.

[]

2. RESTRICT 
- 在执行删除或更新操作前会检查是否有相关的子记录存在。如果有，则拒绝执行该操作，防止外键约束被违反。
- 删除dept上dno=2的结果是不允许删除

In [12]:
%%sql

ALTER TABLE Emp
DROP FOREIGN KEY cascade_emp;

ALTER TABLE Emp
ADD CONSTRAINT restricted_emp
FOREIGN KEY (dno) REFERENCES Dept(dno) ON DELETE RESTRICT ON UPDATE RESTRICT;

ALTER TABLE Dept
DROP FOREIGN KEY cascade_dept;

ALTER TABLE Dept
ADD CONSTRAINT restricted_dept
FOREIGN KEY (manager) REFERENCES Emp(eno) ON DELETE RESTRICT ON UPDATE RESTRICT;

 * mysql://stu2000011483:***@162.105.146.37:53306
0 rows affected.
4 rows affected.
0 rows affected.
4 rows affected.

[]

In [13]:
%%sql
DELETE FROM Dept WHERE dno = 2;

 * mysql://stu2000011483:***@162.105.146.37:53306
(MySQLdb.IntegrityError) (1451, 'Cannot delete or update a parent row: a foreign key constraint fails (`stu2000011483`.`Emp`, CONSTRAINT `restricted_emp` FOREIGN KEY (`dno`) REFERENCES `Dept` (`dno`) ON DELETE RESTRICT ON UPDATE RESTRICT)')
[SQL: DELETE FROM Dept WHERE dno = 2;]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

3. SET NULL

- 当父表中的某行数据被删除或更新时，子表中对应的外键字段会被设置为NULL。这要求子表中外键字段必须允许为NULL值

- 删除dept上dno=3的结果是emp中dno=3的会被赋值为null

In [14]:
%%sql

ALTER TABLE Emp
DROP FOREIGN KEY restricted_emp;

ALTER TABLE Emp
ADD CONSTRAINT null_emp
FOREIGN KEY (dno) REFERENCES Dept(dno) ON DELETE SET NULL ON UPDATE SET NULL;

ALTER TABLE Dept
DROP FOREIGN KEY restricted_dept;

ALTER TABLE Dept
ADD CONSTRAINT null_dept
FOREIGN KEY (manager) REFERENCES Emp(eno) ON DELETE SET NULL ON UPDATE SET NULL;

 * mysql://stu2000011483:***@162.105.146.37:53306
0 rows affected.
4 rows affected.
0 rows affected.
4 rows affected.

[]

In [15]:
%%sql
DELETE FROM Dept WHERE dno = 3;
SELECT LPAD(eno, 4, '0') AS eno, ename, birthday, level, position, salary, LPAD(dno, 4, '0') AS dno FROM Emp;

 * mysql://stu2000011483:***@162.105.146.37:53306
1 rows affected.
4 rows affected.

[('0002', '王五', datetime.date(1990, 3, 3), 5, '会计', Decimal('6000'), None),
 ('0003', '赵六', datetime.date(1995, 4, 4), 2, '秘书', Decimal('3000'), '0004'),
 ('0004', '孙七', datetime.date(2000, 5, 5), 1, '教师', Decimal('2000'), '0005'),
 ('0005', '李四', datetime.date(1985, 2, 2), 3, '教务', Decimal('4000'), '0002')]

# 中级约束设计

In [16]:
%%sql
SELECT * FROM Dept;

 * mysql://stu2000011483:***@162.105.146.37:53306
3 rows affected.

[(2, '计算机学院', Decimal('200000'), 2),
 (4, '电子学院', Decimal('180000'), 4),
 (5, '元培学院', Decimal('120000'), 5)]

In [17]:
%%sql
# 回到外码的CASCADE约束

set @@foreign_key_checks=1;
ALTER TABLE Emp
ADD CONSTRAINT cascade_emp
FOREIGN KEY (dno) REFERENCES Dept(dno) ON DELETE CASCADE ON UPDATE CASCADE;

ALTER TABLE Dept
ADD CONSTRAINT cascade_dept
FOREIGN KEY (manager) REFERENCES Emp(eno) ON DELETE CASCADE ON UPDATE CASCADE;

 * mysql://stu2000011483:***@162.105.146.37:53306
0 rows affected.
4 rows affected.
3 rows affected.

[]

## 1. 测试延迟约束 
- 首先保留外键约束进行违规插入

In [18]:
%%sql


set @@foreign_key_checks=1;


INSERT INTO Dept (dno, dname, budget, manager)
VALUES (1, '数学学院', 100000, 1);


INSERT INTO Emp (eno, ename, birthday, position, salary, dno)
VALUES (1, '张三', '1990-01-01', '教师', 10000, 6);


set @@foreign_key_checks=1;

 * mysql://stu2000011483:***@162.105.146.37:53306
0 rows affected.
(MySQLdb.IntegrityError) (1452, 'Cannot add or update a child row: a foreign key constraint fails (`stu2000011483`.`Dept`, CONSTRAINT `cascade_dept` FOREIGN KEY (`manager`) REFERENCES `Emp` (`eno`) ON DELETE CASCADE ON UPDATE CASCADE)')
[SQL: INSERT INTO Dept (dno, dname, budget, manager)
VALUES (1, '数学学院', 100000, 1);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

可见插入的manager=1不存在，因此不行

- 然后进行延迟约束，即先设置约束无效，然后插入违规的数据，最后设置约束有效

In [19]:
%%sql


set @@foreign_key_checks=0;

INSERT INTO Dept (dno, dname, budget, manager)
VALUES (1, '数学学院', 100000, 1);

INSERT INTO Emp (eno, ename, birthday, position, salary, dno)
VALUES (1, '张三', '1990-01-01', '教师', 10000, 6);


set @@foreign_key_checks=1;

 * mysql://stu2000011483:***@162.105.146.37:53306
0 rows affected.
1 rows affected.
1 rows affected.
0 rows affected.

[]

In [20]:
%sql SELECT LPAD(eno, 4, '0') AS eno, ename, birthday, level, position, salary, LPAD(dno, 4, '0') AS dno FROM Emp;

 * mysql://stu2000011483:***@162.105.146.37:53306
5 rows affected.

[('0001', '张三', datetime.date(1990, 1, 1), 3, '教师', Decimal('10000'), '0006'),
 ('0002', '王五', datetime.date(1990, 3, 3), 5, '会计', Decimal('6000'), None),
 ('0003', '赵六', datetime.date(1995, 4, 4), 2, '秘书', Decimal('3000'), '0004'),
 ('0004', '孙七', datetime.date(2000, 5, 5), 1, '教师', Decimal('2000'), '0005'),
 ('0005', '李四', datetime.date(1985, 2, 2), 3, '教务', Decimal('4000'), '0002')]

In [21]:
%sql SELECT * FROM Dept;

 * mysql://stu2000011483:***@162.105.146.37:53306
4 rows affected.

[(1, '数学学院', Decimal('100000'), 1),
 (2, '计算机学院', Decimal('200000'), 2),
 (4, '电子学院', Decimal('180000'), 4),
 (5, '元培学院', Decimal('120000'), 5)]

由此可见插入是成功的。
因此在mysql中延迟约束是不生效的，其不会在最后设置
~~~
set @@foreign_key_checks=1; 
~~~
之后自动检查约束

In [22]:
%%sql

# 恢复表格
DELETE FROM Dept WHERE dno = 1;
DELETE FROM Emp WHERE eno = 1;

 * mysql://stu2000011483:***@162.105.146.37:53306
1 rows affected.
1 rows affected.

[]

## 2. 划分salary为5个区间
- 这里选择了5个区间（1-5），分别是2000-4000,4000-6000,6000-8000,8000-10000,10000以上
- 为了方便，我们重新建一个emp1表，来实现这个功能

In [23]:
%%sql

# 添加虚拟列
# 通过CHECK约束保证虚拟列的值和level列的值相等
drop table if exists Emp1;
CREATE TABLE Emp1 (
    eno bigint(4) unsigned zerofill PRIMARY KEY NOT NULL AUTO_INCREMENT,
    ename VARCHAR(255),
    birthday DATE,
    level INT DEFAULT 3 CHECK (level >= 1 AND level <= 5),
    position ENUM('教师', '教务', '会计', '秘书'),
    salary DECIMAL CHECK (salary >= 2000 AND salary <= 200000),
    dno bigint(4) unsigned zerofill,
    level_calculated INT GENERATED ALWAYS AS (
        CASE 
            WHEN salary BETWEEN 2000 AND 4000 THEN 1
            WHEN salary BETWEEN 4001 AND 6000 THEN 2
            WHEN salary BETWEEN 6001 AND 8000 THEN 3
            WHEN salary BETWEEN 8001 AND 10000 THEN 4
            WHEN salary > 10000 THEN 5
            ELSE 3
        END
    ) STORED,
    CONSTRAINT chk_level_calculated CHECK (level_calculated = level)
);

 * mysql://stu2000011483:***@162.105.146.37:53306
0 rows affected.
0 rows affected.

[]

尝试仍进行之前的违规的salary插入，发现不行

In [24]:
%%sql
INSERT INTO Emp1 (ename, birthday, level, position, salary, dno) VALUES 
('张三', '1980-01-01', 4, '教师', 5000, 1),
('王五', '1990-03-03', 5, '会计', 6000, 3),
('赵六', '1995-04-04', 2, '秘书', 3000, 4),
('孙七', '2000-05-05', 1, '教师', 2000, 5);

 * mysql://stu2000011483:***@162.105.146.37:53306
(MySQLdb.OperationalError) (3819, "Check constraint 'chk_level_calculated' is violated.")
[SQL: INSERT INTO Emp1 (ename, birthday, level, position, salary, dno) VALUES
('张三', '1980-01-01', 4, '教师', 5000, 1),
('王五', '1990-03-03', 5, '会计', 6000, 3),
('赵六', '1995-04-04', 2, '秘书', 3000, 4),
('孙七', '2000-05-05', 1, '教师', 2000, 5);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

改为插入合法的salary&level，成功

In [25]:
%%sql

INSERT INTO Emp1 (ename, birthday, level, position, salary, dno) VALUES 
('张三', '1980-01-01', 4, '教师', 8500, 1),
('王五', '1990-03-03', 5, '会计', 15000, 3),
('赵六', '1995-04-04', 2, '秘书', 4200, 4),
('孙七', '2000-05-05', 1, '教师', 2000, 5);

 * mysql://stu2000011483:***@162.105.146.37:53306
4 rows affected.

[]

In [26]:
%sql SELECT LPAD(eno, 4, '0') AS eno, ename, birthday, level, position, salary, LPAD(dno, 4, '0') AS dno FROM Emp1;

 * mysql://stu2000011483:***@162.105.146.37:53306
4 rows affected.

[('0001', '张三', datetime.date(1980, 1, 1), 4, '教师', Decimal('8500'), '0001'),
 ('0002', '王五', datetime.date(1990, 3, 3), 5, '会计', Decimal('15000'), '0003'),
 ('0003', '赵六', datetime.date(1995, 4, 4), 2, '秘书', Decimal('4200'), '0004'),
 ('0004', '孙七', datetime.date(2000, 5, 5), 1, '教师', Decimal('2000'), '0005')]

## 3. 编写员工智能码
- 我们仍在原先的Emp和Dept表上进行操作,将其恢复完整

In [27]:
%sql SELECT * FROM Dept;

 * mysql://stu2000011483:***@162.105.146.37:53306
3 rows affected.

[(2, '计算机学院', Decimal('200000'), 2),
 (4, '电子学院', Decimal('180000'), 4),
 (5, '元培学院', Decimal('120000'), 5)]

In [30]:
%%sql
#恢复表格完整
UPDATE Emp
SET dno = 2
WHERE eno = 2;

SELECT LPAD(eno, 4, '0') AS eno, ename, birthday, level, position, salary, LPAD(dno, 4, '0') AS dno FROM Emp;

 * mysql://stu2000011483:***@162.105.146.37:53306
1 rows affected.
4 rows affected.

[('0002', '王五', datetime.date(1990, 3, 3), 5, '会计', Decimal('6000'), '0002'),
 ('0003', '赵六', datetime.date(1995, 4, 4), 2, '秘书', Decimal('3000'), '0004'),
 ('0004', '孙七', datetime.date(2000, 5, 5), 1, '教师', Decimal('2000'), '0005'),
 ('0005', '李四', datetime.date(1985, 2, 2), 3, '教务', Decimal('4000'), '0002')]

- 首先创建编码表

In [50]:
%%sql

drop table if exists Employee_Code;
CREATE TABLE Employee_Code (
    eno bigint(4) unsigned zerofill PRIMARY KEY,
    code VARCHAR(20)
);

INSERT INTO Employee_Code (eno, code)
SELECT 
    eno,
    CONCAT(
        LPAD(eno, 4, '0'), 
        LPAD(Emp.dno, 4, '0'), 
        LPAD(EXTRACT(YEAR FROM birthday), 4, '0'), 
        LPAD(level, 2, '0'), 
        LPAD(position+1-1, 2, '0'),
        LPAD(manager, 4, '0') 
    ) AS empcode
FROM 
    Emp
JOIN 
    Dept ON Emp.dno = Dept.dno;

SELECT * FROM Employee_Code;

 * mysql://stu2000011483:***@162.105.146.37:53306
0 rows affected.
0 rows affected.
4 rows affected.
4 rows affected.

[(2, '00020002199005030002'),
 (3, '00030004199502040004'),
 (4, '00040005200001010005'),
 (5, '00050002198503020002')]

- 然后构建函数直接在编码对照表中查找对应的编码

In [53]:
%%sql


CREATE FUNCTION Get_Employee_Code(eno_in bigint(4)) RETURNS VARCHAR(20)
READS SQL DATA
DETERMINISTIC
BEGIN
    DECLARE empcode VARCHAR(20);
    
    SELECT code INTO empcode
    FROM Employee_Code
    WHERE eno = eno_in;
    
    RETURN emp_code;
END;

# 没有super权限 函数无法创建。。。。。

 * mysql://stu2000011483:***@162.105.146.37:53306
(MySQLdb.OperationalError) (1419, 'You do not have the SUPER privilege and binary logging is enabled (you *might* want to use the less safe log_bin_trust_function_creators variable)')
[SQL: CREATE FUNCTION Get_Employee_Code(eno_in bigint(4)) RETURNS VARCHAR(20)
READS SQL DATA
DETERMINISTIC
BEGIN
    DECLARE empcode VARCHAR(20);

    SELECT code INTO empcode
    FROM Employee_Code
    WHERE eno = eno_in;

    RETURN emp_code;
END;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)